# How to Read Data using Pandas

## Reading File Using Pandas

In [1]:
import pandas as pd

from IPython.display import display

In [2]:
csv_data = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/shopping_data.csv")
# csv_data.to_csv(r"D:\Usep Syaikal Arifin\Computer Programming\Python\Applications File Data Science PT United Tractor\Data Wrangling Python\File Dokumentasi\File CSV\shopping_data.csv", index=None, header=True)
# csv_data.to_excel(r"D:\Usep Syaikal Arifin\Computer Programming\Python\Applications File Data Science PT United Tractor\Data Wrangling Python\File Dokumentasi\File Excel\shopping_data.xlsx", index=None, header=True)

display(csv_data.head())

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

## Reading File Using Head Methods

In [3]:
display(csv_data.head())

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

## Acces Data Columns

In [4]:
display(csv_data.head())

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

## Acces Data Rows

In [7]:
display(csv_data.iloc[4:10])

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
4           5  Female   31                  17                      40
5           6  Female   22                  17                      76
6           7  Female   35                  18                       6
7           8  Female   23                  18                      94
8           9    Male   64                  19                       3
9          10  Female   30                  19                      72

## Show From Certain Data Columns & Rows

In [8]:
print("Cuplikan Dataset : ")
display(csv_data["Age"].iloc[1])
display(csv_data.head())

Cuplikan Dataset :

21

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

## Show Certain Ranges Data

In [9]:
print("Show index 5 data until before index 10 Data : ")
display(csv_data[5:10])

Show index 5 data until before index 10 Data :

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
5           6  Female   22                  17                      76
6           7  Female   35                  18                       6
7           8  Female   23                  18                      94
8           9    Male   64                  19                       3
9          10  Female   30                  19                      72

## Show Statistic Information Using Numpy

In [10]:
display(csv_data.describe())

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

# Missing Data & Data Normalization

## Checking Existing Null Value & Missing Value

In [12]:
display(csv_data.isnull().values.any())
display(csv_data.isnull().sum())

False

CustomerID                0
Genre                     0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

## Handling  Missing Value

In [13]:
csv_data_missing_value = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/shopping_data_missingvalue.csv")
print("Checking Existing Missing Value or Null Value = ?")
display(csv_data_missing_value.isnull().sum())

Checking Existing Missing Value or Null Value = ?

CustomerID                0
Genre                     0
Age                       1
Annual Income (k$)        2
Spending Score (1-100)    2
dtype: int64

### Imputation : Mean()

In [21]:
csv_data = csv_data_missing_value.copy()

print("Dataset that still have Missing Value = ?")
display(csv_data.isnull().sum())
display(csv_data.select_dtypes("number").mean())

missing_value_columns = csv_data.columns[csv_data.isnull().any()]
csv_data[missing_value_columns] = csv_data[missing_value_columns].fillna(csv_data[missing_value_columns].mean())

print("Dataset that still have Missing Value = ?")
display(csv_data.isnull().sum())
display(csv_data.select_dtypes("number").mean())

Dataset that still have Missing Value = ?

CustomerID                0
Genre                     0
Age                       1
Annual Income (k$)        2
Spending Score (1-100)    2
dtype: int64

CustomerID                100.500000
Age                        38.939698
Annual Income (k$)         61.005051
Spending Score (1-100)     50.489899
dtype: float64

Dataset that still have Missing Value = ?

CustomerID                0
Genre                     0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

CustomerID                100.500000
Age                        38.939698
Annual Income (k$)         61.005051
Spending Score (1-100)     50.489899
dtype: float64

### imputation : Median()

In [22]:
csv_data = csv_data_missing_value.copy()

print("Dataset that still have Missing Value = ?")
display(csv_data.isnull().sum())
display(csv_data.select_dtypes("number").mean())

missing_value_columns = csv_data.columns[csv_data.isnull().any()]
csv_data[missing_value_columns] = csv_data[missing_value_columns].fillna(csv_data[missing_value_columns].median())

print("Dataset that still have Missing Value = ?")
display(csv_data.isnull().sum())
display(csv_data.select_dtypes("number").mean())

Dataset that still have Missing Value = ?

CustomerID                0
Genre                     0
Age                       1
Annual Income (k$)        2
Spending Score (1-100)    2
dtype: int64

CustomerID                100.500000
Age                        38.939698
Annual Income (k$)         61.005051
Spending Score (1-100)     50.489899
dtype: float64

Dataset that still have Missing Value = ?

CustomerID                0
Genre                     0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

CustomerID                100.500
Age                        38.925
Annual Income (k$)         61.015
Spending Score (1-100)     50.485
dtype: float64

## Data Normalization

In [25]:
from sklearn.preprocessing import MinMaxScaler

In [24]:
csv_data = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/shopping_data.csv")
display(csv_data.head())

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

### Data Normalization Using Scikit Learn

In [29]:
csv_data_normalization = csv_data.copy()
min_max_scaler = MinMaxScaler()

scaller_columns = csv_data_normalization.columns[2:]

csv_data_normalization[scaller_columns] = min_max_scaler.fit_transform(csv_data_normalization[scaller_columns])

display(csv_data_normalization.head())

   CustomerID   Genre       Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male  0.019231            0.000000                0.387755
1           2    Male  0.057692            0.000000                0.816327
2           3  Female  0.038462            0.008197                0.051020
3           4  Female  0.096154            0.008197                0.775510
4           5  Female  0.250000            0.016393                0.397959